---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagBadViewType
source: html/fccbe64c-8621-f8cc-6b63-b61581a2775a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagBadViewType Property

[Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTagBadViewType { get; }
```